#+TITLE: The way I understood Lisp.
#+AUTHOR: R.Sreekumar, Ph.D.
#+EMAIL: sreekumar@am.amrita.edu
#+LaTeX_HEADER: \usepackage{charter}
#+OPTIONS: toc:nil

** Aside:
   I wrote a program which returns boolean value.  Generally
   lisp returns /true/ or /false/.  But this is only for
   primitive operations working on numbers such as equal to,
   not equal to, greater than, less than, etc.

   This is my attempt that returning coustomized return
   values.

   #+begin_src scheme exports: both
   (define (divisible m n) (if (= 0 (remainder m n)) #t #f))
   (list
      (divisible 4 8)
      (divisible 8 4))
   #+end_src

   #+RESULTS:
   : '(#f #t)

